# BuiltInFailures.SkylightFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SkylightFailures Class
BuiltInFailures Class Members See Also
---
Failures about Skylight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SkylightFailures
```

Visual Basic
---
```text
Public NotInheritable Class SkylightFailures
```

Visual C++
---
```text
public ref class SkylightFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SkylightFailures
# See Also
BuiltInFailures..::..SkylightFailures Members
Autodesk.Revit.DB Namespace